DataProcessors/АрхивацияПрикрепленныхДанных.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<DataProcessor>
		<Properties>
			<Name>АрхивацияПрикрепленныхДанных</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

InformationRegisters/ПрикрепленныеДанные.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ПрикрепленныеДанные</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Данные</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Расширение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>5</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Размер</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Архивирован</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВариантАрхивации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВариантыАрхивацииПрикрепленныхДанных</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПутьАрхивации</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаАрхивации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторФайлаGD</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторПапкиGD</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ВидФайлаПрограммыПостроителя</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыФайловПрограммыПостроителя</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СсылкаНаОбъект</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Монтаж</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказПоставщику</v8:Type>
						<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказДоговор</v8:Type>
						<v8:Type>cfg:DocumentRef.УДАЛИТЬ_Замер</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказНаПроизводство</v8:Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаявкаНаДоставку</v8:Type>
						<v8:Type>cfg:DocumentRef.Лид</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИмяФайла</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

DataProcessors/АрхивацияПрикрепленныхДанных/Forms/Форма/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	СформироватьЗаголовокВсегоФайлов();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьЗаголовокВсегоФайлов(Команда)
	СформироватьЗаголовокВсегоФайлов();	
КонецПроцедуры

&НаСервере
Процедура СформироватьЗаголовокВсегоФайлов()
	
	СтруктураРезультата = ПолучитьКоличествоФайловНаСервере();
	 
	ТекстДекорации = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		"Всего файлов в базе: %1 (объем %2 Кб)",
		Формат(СтруктураРезультата.Количество, "ЧГ="), 
		Формат(СтруктураРезультата.Размер, "ЧДЦ=; ЧРГ="));
		
	Элементы.ДекорацияВсегоФайлов.Заголовок = ТекстДекорации;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьКоличествоФайловНаСервере()
	
	СтруктураРезультата = Новый Структура("Количество, Размер", 0, 0);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	КОЛИЧЕСТВО(*) КАК Количество,
	|	Сумма(ПрикрепленныеДанные.Размер) КАК Размер
	|ИЗ
	|	РегистрСведений.ПрикрепленныеДанные КАК ПрикрепленныеДанные
	|ГДЕ
	|	НЕ ПрикрепленныеДанные.Архивирован";
	
	Запрос.УстановитьПараметр("ИспользоватьДатаНачала", НачалоДатаФайла <> Дата(1, 1, 1));
	Запрос.УстановитьПараметр("ИспользоватьДатаКонца", 	КонецДатаФайла<> Дата(1, 1, 1));
	Запрос.УстановитьПараметр("ДатаНачала", 			НачалоДня(НачалоДатаФайла));
	Запрос.УстановитьПараметр("ДатаКонца", 				КонецДня(КонецДатаФайла));
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	Если Выборка.Следующий() Тогда
		СтруктураРезультата.Количество = Выборка.Количество;
		СтруктураРезультата.Размер = Выборка.Размер;
	КонецЕсли;
	
	Возврат СтруктураРезультата;
	
КонецФункции

&НаСервере
Процедура ПолучитьДанныеНаСервере()
	
	ФайлыДерево.ПолучитьЭлементы().Очистить();
	ФайлыКОбработке.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ПрикрепленныеДанные.Период,
	|	ПрикрепленныеДанные.ИмяФайла,
	|	ПрикрепленныеДанные.ВидФайлаПрограммыПостроителя,
	|	ПрикрепленныеДанные.СсылкаНаОбъект,
	|	ПрикрепленныеДанные.Размер
	|ИЗ
	|	РегистрСведений.ПрикрепленныеДанные КАК ПрикрепленныеДанные
	|ГДЕ
	|	НЕ ПрикрепленныеДанные.Архивирован
	|	И ВЫБОР
	|			КОГДА &ИспользоватьДатаНачала
	|				ТОГДА ПрикрепленныеДанные.Период >= &ДатаНачала
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|	И ВЫБОР
	|			КОГДА &ИспользоватьДатаКонца
	|				ТОГДА ПрикрепленныеДанные.Период <= &ДатаКонца
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|	И ВЫБОР
	|		КОГДА &ИспользоватьОтборПоРазмеру
	|			ТОГДА ПрикрепленныеДанные.Размер > &РазмерБолее
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ
	|
	|УПОРЯДОЧИТЬ ПО
	|	Период";
	
	Запрос.УстановитьПараметр("ИспользоватьДатаНачала", НачалоДатаФайла <> Дата(1, 1, 1));
	Запрос.УстановитьПараметр("ИспользоватьДатаКонца", 	КонецДатаФайла<> Дата(1, 1, 1));
	Запрос.УстановитьПараметр("ДатаНачала", 			НачалоДня(НачалоДатаФайла));
	Запрос.УстановитьПараметр("ДатаКонца", 				КонецДня(КонецДатаФайла));
	Запрос.УстановитьПараметр("ИспользоватьОтборПоРазмеру", ИспользоватьОтборПоРазмеру);
	Запрос.УстановитьПараметр("РазмерБолее", РазмерБолее);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		НоваяСтрока = ФайлыКОбработке.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
		НоваяСтрока.ВидОбъекта = НоваяСтрока.СсылкаНаОбъект.Метаданные().Имя;
	КонецЦикла;
	Элементы.Индикатор.МаксимальноеЗначение = Выборка.Количество();
	
КонецПроцедуры

&НаСервере
Функция ПолучитьРазмерФайла(СтруктураПоиска)
	
	МенеджерЗаписи = РегистрыСведений.ПрикрепленныеДанные.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Период						= СтруктураПоиска.Период;
	МенеджерЗаписи.ВидФайлаПрограммыПостроителя = СтруктураПоиска.ВидФайлаПрограммыПостроителя;
	МенеджерЗаписи.СсылкаНаОбъект 				= СтруктураПоиска.СсылкаНаОбъект;
	МенеджерЗаписи.ИмяФайла 					= СтруктураПоиска.ИмяФайла;						

	Попытка
		МенеджерЗаписи.Прочитать();
		РазмерФайла = МенеджерЗаписи.Данные.Получить().Размер()/1024;
		
		Возврат РазмерФайла;
		
		//++ №9396 комментируем, т.к. переделано на Дерево
		//Если (ИспользоватьОтборПоРазмеру И РазмерФайла > РазмерБолее)
		//	ИЛИ НЕ ИспользоватьОтборПоРазмеру Тогда
		//	НовыйФайл = Файлы.Добавить();
		//	ЗаполнитьЗначенияСвойств(НовыйФайл, МенеджерЗаписи);
		//	НовыйФайл.Пометка = Истина;
		//	НовыйФайл.Размер = РазмерФайла;	
		//	
		//	КоличествоПолученныхФайлов = КоличествоПолученныхФайлов + 1;
		//КонецЕсли;
		//-- №9396 комментируем, т.к. переделано на Дерево
		
	Исключение
		
		Возврат 0;
		
	КонецПопытки;

КонецФункции

&НаКлиенте
Процедура ПолучитьДанные(Команда)	
	
	КоличествоПолученныхФайлов = 0;
	Индикатор = 0;
	Элементы.Индикатор.Видимость = Истина;
	ПолучитьДанныеНаСервере();
	
	//++ №9396 комментируем, т.к. переделано на Дерево
	//Для Каждого ЭлементТаблицы Из ФайлыКОбработке Цикл
	//	ОбработкаПрерыванияПользователя();
	//	
	//	СтруктураДанных = Новый Структура;
	//	СтруктураДанных.Вставить("Период", ЭлементТаблицы.Период);
	//	СтруктураДанных.Вставить("ВидФайлаПрограммыПостроителя", ЭлементТаблицы.ВидФайлаПрограммыПостроителя);
	//	СтруктураДанных.Вставить("СсылкаНаОбъект", ЭлементТаблицы.СсылкаНаОбъект);
	//	СтруктураДанных.Вставить("ИмяФайла", ЭлементТаблицы.ИмяФайла);
	//	ПолучитьРазмерФайла(СтруктураДанных);
	//	
	//	Индикатор = Индикатор + 1;
	//	ОбновитьОтображениеДанных();
	//КонецЦикла;
	//-- №9396 комментируем, т.к. переделано на Дерево
	
	ПостроитьДеревоСтатусов(); // №9396
	
КонецПроцедуры

&НаКлиенте
Процедура ОтметитьВсеФайлы(Команда)
	
	Для каждого ЭлементТаблицы из ФайлыДерево.ПолучитьЭлементы() Цикл
		Если НЕ ЭлементТаблицы.Архивирован Тогда
			ЭлементТаблицы.Пометка = Истина;
		КонецЕсли;	
		Для Каждого ПодчиненныйЭлемент Из ЭлементТаблицы.ПолучитьЭлементы() Цикл
			Если НЕ ПодчиненныйЭлемент.Архивирован Тогда
				ПодчиненныйЭлемент.Пометка = Истина;
			КонецЕсли;	
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура СнятьОтметкуВсеФайлы(Команда)
	
	Для каждого ЭлементТаблицы из ФайлыДерево.ПолучитьЭлементы() Цикл
		ЭлементТаблицы.Пометка = Ложь;
		Для Каждого ПодчиненныйЭлемент Из ЭлементТаблицы.ПолучитьЭлементы() Цикл
			ПодчиненныйЭлемент.Пометка = Ложь;
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура УдалитьФайлыНаСервере()
	
	ЭлементыМетаданных = ФайлыДерево.ПолучитьЭлементы();
	Для каждого РодительТаблицы из ЭлементыМетаданных Цикл
		ЭлементыОбъектов = РодительТаблицы.ПолучитьЭлементы();
		КоличествоЭлементовОбъекта = ЭлементыОбъектов.Количество();
		Для Индекс = 1 По КоличествоЭлементовОбъекта Цикл
			ЭлементТаблицы = ЭлементыОбъектов[КоличествоЭлементовОбъекта - Индекс];
			Если ЭлементТаблицы.Пометка Тогда
				МенеджерЗаписи = РегистрыСведений.ПрикрепленныеДанные.СоздатьМенеджерЗаписи();
				МенеджерЗаписи.Период						= ЭлементТаблицы.Период;
				МенеджерЗаписи.ВидФайлаПрограммыПостроителя = ЭлементТаблицы.ВидФайлаПрограммыПостроителя;
				МенеджерЗаписи.СсылкаНаОбъект 				= ЭлементТаблицы.СсылкаНаОбъект;
				МенеджерЗаписи.ИмяФайла 					= ЭлементТаблицы.ИмяФайла;						
				Попытка
					МенеджерЗаписи.Прочитать();
					МенеджерЗаписи.Удалить();
					
					ЭлементыОбъектов.Удалить(ЭлементТаблицы);
				Исключение
					Сообщить(ОписаниеОшибки());
				КонецПопытки;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
	СформироватьЗаголовокВсегоФайлов();
	
КонецПроцедуры

&НаКлиенте
Процедура УдалитьФайлыКоманда(Команда)
	
	УдалитьФайлыНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура РазмерБолееПриИзменении(Элемент) 
	
	ИспользоватьОтборПоРазмеру = РазмерБолее > 0;
	
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьДанныеБезРазмера(Команда)
	
	//КоличествоПолученныхФайлов = 0;
	//Индикатор = 0;
	//Элементы.Индикатор.Видимость = Истина;
	//ПолучитьДанныеНаСервере();
	//
	//Для Каждого ЭлементТаблицы Из ФайлыКОбработке Цикл
	//	ОбработкаПрерыванияПользователя();
	//	
	//	НовыйФайл = Файлы.Добавить();
	//	ЗаполнитьЗначенияСвойств(НовыйФайл, ЭлементТаблицы);
	//	НовыйФайл.Пометка = Истина;	
	//		
	//	КоличествоПолученныхФайлов = КоличествоПолученныхФайлов + 1;
	//	
	//	Индикатор = Индикатор + 1;
	//	ОбновитьОтображениеДанных();
	//КонецЦикла;
	
КонецПроцедуры


//++ №9396
&НаКлиенте
Процедура ПостроитьДеревоСтатусов()
	
	ФайлыДерево.ПолучитьЭлементы().Очистить();
	
	РодителиДерева = ПолучитьМассивРодителейДерева();
	
	Для Каждого Родитель Из РодителиДерева Цикл
		
		НовыйРодитель = ФайлыДерево.ПолучитьЭлементы().Добавить();
		НовыйРодитель.ВидОбъекта = Родитель.ВидОбъекта;
		НовыйРодитель.Пометка = Истина;
		
		РазмерПоРодителю = 0;
		НайденныеСтроки = ФайлыКОбработке.НайтиСтроки(новый Структура("ВидОбъекта", Родитель.ВидОбъекта));
		Для Каждого ТекущаяСтрока Из НайденныеСтроки Цикл
			
			ОбработкаПрерыванияПользователя();
			
			// В регистре добавили ресурс Размер
			//Добавлять = Истина;
			//РазмерФайла = 0;
			//Если СРазмеромФайлов Тогда
			//	
			//	СтруктураДанных = Новый Структура;
			//	СтруктураДанных.Вставить("Период", ТекущаяСтрока.Период);
			//	СтруктураДанных.Вставить("ВидФайлаПрограммыПостроителя", ТекущаяСтрока.ВидФайлаПрограммыПостроителя);
			//	СтруктураДанных.Вставить("СсылкаНаОбъект", ТекущаяСтрока.СсылкаНаОбъект);
			//	СтруктураДанных.Вставить("ИмяФайла", ТекущаяСтрока.ИмяФайла);
			//	РазмерФайла = ПолучитьРазмерФайла(СтруктураДанных);
			//	
			//	Если НЕ ((ИспользоватьОтборПоРазмеру И РазмерФайла > РазмерБолее) ИЛИ НЕ ИспользоватьОтборПоРазмеру) Тогда
			//		Добавлять = Ложь;
			//	КонецЕсли;
			//	
			//КонецЕсли;
			//
			//Если Добавлять Тогда
			
			КоличествоПолученныхФайлов = КоличествоПолученныхФайлов + 1;
			
			НовыйЭлемент = НовыйРодитель.ПолучитьЭлементы().Добавить();
			ЗаполнитьЗначенияСвойств(НовыйЭлемент, ТекущаяСтрока);
			//НовыйЭлемент.Размер = РазмерФайла;
			НовыйЭлемент.Пометка = Истина;
			РазмерПоРодителю = РазмерПоРодителю + НовыйЭлемент.Размер;
				
			//КонецЕсли;
			
			Индикатор = Индикатор + 1;
			ОбновитьОтображениеДанных();
			
		КонецЦикла;
		
		НовыйРодитель.Размер = РазмерПоРодителю;
		
		// Если Родитель без подчиненных элементов (когда был отбор по размеру, удалим его)
		Если НовыйРодитель.ПолучитьЭлементы().Количество() = 0 Тогда
			ФайлыДерево.ПолучитьЭлементы().Удалить(ФайлыДерево.ПолучитьЭлементы().Индекс(НовыйРодитель));
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Функция ПолучитьМассивРодителейДерева()
	
	РодителиДерева = ФайлыКОбработке.Выгрузить(, "ВидОбъекта");
	РодителиДерева.Свернуть("ВидОбъекта");
	
	Возврат ОбщегоНазначения.ТаблицаЗначенийВМассив(РодителиДерева);
	
КонецФункции

&НаКлиенте
Процедура ФайлыДеревоПометкаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ФайлыДерево.ТекущиеДанные;
	
	// Поменяли в корне, нужно все подчиненные изменить
	Если ТекущиеДанные.ПолучитьРодителя() = Неопределено Тогда
		
		Для Каждого Родитель Из ФайлыДерево.ПолучитьЭлементы() Цикл
			Если Родитель.ВидОбъекта = ТекущиеДанные.ВидОбъекта Тогда
				Для Каждого ТекущаяСтрока Из Родитель.ПолучитьЭлементы() Цикл
					Пометка = ТекущиеДанные.Пометка;
					Если ТекущаяСтрока.Архивирован Тогда
						Пометка = Ложь;
					КонецЕсли;
					ТекущаяСтрока.Пометка = Пометка;
				КонецЦикла;
			КонецЕсли;
		КонецЦикла;
		
	Иначе
		
		// Поменяли подчиненный корню элемент, если у всех подчиненных элементов один признак, установим его корню
		ПризнакиРавны = Истина;
	    Для Каждого ПодчиненныйЭлемент Из ТекущиеДанные.ПолучитьРодителя().ПолучитьЭлементы() Цикл
			Если НЕ ПодчиненныйЭлемент.Пометка = ТекущиеДанные.Пометка И НЕ ПодчиненныйЭлемент.Архивирован Тогда
				ПризнакиРавны = Ложь;
			КонецЕсли;
		КонецЦикла;
		
		Если ПризнакиРавны Тогда
			ТекущиеДанные.ПолучитьРодителя().Пометка = ТекущиеДанные.Пометка;
		Иначе
			ТекущиеДанные.ПолучитьРодителя().Пометка = Ложь;
		КонецЕсли;
	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьАрхивацию(Команда)
	
	НачатьПодключениеРасширенияРаботыСФайлами(Новый ОписаниеОповещения("КаталогВыгрузкиНачалоВыбораЗавершение1", ЭтотОбъект));
	
КонецПроцедуры

&НаКлиенте
Процедура КаталогВыгрузкиНачалоВыбораЗавершение1(Подключено, ДополнительныеПараметры) Экспорт
    
    Если Не Подключено Тогда
		ОтветОповещения = Новый ОписаниеОповещения("ВыборФайлаЗавершить", ЭтотОбъект);
		ЗадатьВопросУстановкиРасширения(ОтветОповещения);
		
        Возврат;
    КонецЕсли;
    
    Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.ВыборКаталога);
    
    Диалог.Заголовок = НСтр("ru = 'Укажите каталог архивации'");
    Диалог.Каталог = КаталогВыгрузки;
    
    Диалог.Показать(Новый ОписаниеОповещения("КаталогВыгрузкиНачалоВыбораЗавершение", ЭтотОбъект, Новый Структура("Диалог", Диалог)));

КонецПроцедуры

&НаКлиенте
Процедура КаталогВыгрузкиНачалоВыбораЗавершение(ВыбранныеФайлы, ДополнительныеПараметры) Экспорт
    
    Диалог = ДополнительныеПараметры.Диалог;
    
    Если (ВыбранныеФайлы <> Неопределено) Тогда
        КаталогВыгрузки = Диалог.Каталог;
		ВыполнитьАрхивациюПослеУказанияКаталога();
    КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ВыборФайлаЗавершить(Результат) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПоказатьДиалогВыбораФайла();
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьДиалогВыбораФайла()
	
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.ВыборКаталога);
	
	Диалог.Заголовок = НСтр("ru = 'Укажите каталог архивации'");
	Диалог.Каталог = КаталогВыгрузки;
	
	Оповещение = Новый ОписаниеОповещения("ПослеВыбораКаталогаВыгрузки", ЭтотОбъект);
	
	Диалог.Показать(Оповещение);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗадатьВопросУстановкиРасширения(ОповещениеВопроса)
	
	ТекстВопроса= НСтр("ru = 'Для данной операции необходимо установить расширение работы с файлами.
							|Установить расширение работы с файлами ?'");
							
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ОповещениеВопроса", ОповещениеВопроса);
	
	ОтветОповещения = Новый ОписаниеОповещения("ВопросУстановитьРасширениеЗавершить", ЭтотОбъект, ДополнительныеПараметры);
	ПоказатьВопрос(ОтветОповещения, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
	
КонецПроцедуры

&НаКлиенте
Процедура ВопросУстановитьРасширениеЗавершить(Ответ, ДополнительныеПараметры) Экспорт
	
	Если Ответ = КодВозвратаДиалога.Да Тогда
		
		УстановитьРасширениеОповещение = ДополнительныеПараметры.ОповещениеВопроса;
		
		НачатьУстановкуРасширенияРаботыСФайлами(УстановитьРасширениеОповещение);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВыбораКаталогаВыгрузки(ВыбранныеФайлы, ДополнительныеПараметры = Неопределено) Экспорт
	
	Если ВыбранныеФайлы <> Неопределено Тогда
		КаталогВыгрузки = ВыбранныеФайлы[0];
		ВыполнитьАрхивациюПослеУказанияКаталога();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьАрхивациюПослеУказанияКаталога()
	
	Если НЕ ЗначениеЗаполнено(КаталогВыгрузки) Тогда
		Возврат;
	КонецЕсли;
	
	СистемнаяИнформация = Новый СистемнаяИнформация;
	ПлатформаWindows = СистемнаяИнформация.ТипПлатформы = ТипПлатформы.Windows_x86
		ИЛИ СистемнаяИнформация.ТипПлатформы = ТипПлатформы.Windows_x86_64;
	
	// Сначала создадим каталоги по видам и объектам
	МассивКаталогов = ПолучитьМассивКаталогов();
	
	Для Каждого КаталогПоВиду Из МассивКаталогов Цикл
		
		// Создаем каталог по виду
		ПолноеИмяКаталогаПоВиду = КаталогВыгрузки + "\" + КаталогПоВиду.ВидОбъекта;
		ПолноеИмяКаталогаПоВиду = ПодготовитьПутьДляПлатформы(ПлатформаWindows, ПолноеИмяКаталогаПоВиду);
		КаталогСоздан = Ложь;
		Попытка
			СоздатьКаталог(ПолноеИмяКаталогаПоВиду);
			КаталогСоздан = Истина;
		Исключение
			Сообщить("Не удалось создать каталог по виду объекта: " + КаталогПоВиду + Символы.ПС + ОписаниеОшибки());
		КонецПопытки;
		
		// Если каталог по виду создан, создаем каталоги по объекту внутри
		Если КаталогСоздан Тогда
			
			Для Каждого КаталогПоОбъекту Из КаталогПоВиду.МассивПодКаталогов Цикл
				
				// Создаем каталог по виду
				ПолноеИмяКаталогаПоОбъекту = ПолноеИмяКаталогаПоВиду + "\" + УбратьЗарезервированныеСимволыВИмениКаталога(КаталогПоОбъекту);
				ПолноеИмяКаталогаПоОбъекту = ПодготовитьПутьДляПлатформы(ПлатформаWindows, ПолноеИмяКаталогаПоОбъекту);
				КаталогСоздан = Ложь;
				Попытка
					СоздатьКаталог(ПолноеИмяКаталогаПоОбъекту);
					КаталогСоздан = Истина;
				Исключение
					Сообщить("Не удалось создать каталог по объекту: " + КаталогПоОбъекту + Символы.ПС + ОписаниеОшибки());
				КонецПопытки;
				
			КонецЦикла
			
		КонецЕсли;
		
	КонецЦикла;
	
	// Теперь выгружаем файлы в каталог и удаляем из базы
	Для Каждого РодительДерева Из ФайлыДерево.ПолучитьЭлементы() Цикл
		
		Для Каждого ЭлементДерева Из РодительДерева.ПолучитьЭлементы() Цикл
			
			Если НЕ ЭлементДерева.Пометка Тогда
				Продолжить;
			КонецЕсли;	
			
			СтруктураДанных = Новый Структура;
			СтруктураДанных.Вставить("Период", ЭлементДерева.Период);
			СтруктураДанных.Вставить("ВидФайлаПрограммыПостроителя", ЭлементДерева.ВидФайлаПрограммыПостроителя);
			СтруктураДанных.Вставить("СсылкаНаОбъект", ЭлементДерева.СсылкаНаОбъект);
			СтруктураДанных.Вставить("ИмяФайла", ЭлементДерева.ИмяФайла);
			
			ДанныеФайла = ПолучитьДанныеФайла(СтруктураДанных);
			
			Если НЕ ДанныеФайла = Неопределено Тогда
				
				ИмяФайлаСРасширением = ЭлементДерева.ИмяФайла + "." + ДанныеФайла.Расширение;
				ПутьФайла = КаталогВыгрузки + "\" + ЭлементДерева.ВидОбъекта + "\" + УбратьЗарезервированныеСимволыВИмениКаталога(Строка(ЭлементДерева.СсылкаНаОбъект)) + "\" + ИмяФайлаСРасширением;
				ПутьФайла = ПодготовитьПутьДляПлатформы(ПлатформаWindows, ПутьФайла);
				
				Попытка
					ПолучитьФайл(ДанныеФайла.АдресВХранилище, ПутьФайла, Ложь);
					ЭлементДерева.Архивирован = Истина;
					ЭлементДерева.Пометка = Ложь;
					УдалитьФайлПослеАрхивации(СтруктураДанных);
				Исключение
					Сообщить("Не удалось выгрузить файл для объекта """ + ЭлементДерева.СсылкаНаОбъект + """ с наименованием: " + ИмяФайлаСРасширением + Символы.ПС + ОписаниеОшибки());
				КонецПопытки;
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЦикла;
	
	// Обновим признаки "Архивирован" для родителей
	ОбновитьПризникАрхивированДляРодителей();
	
	СформироватьЗаголовокВсегоФайлов();
	
	ПоказатьОповещениеПользователя("Архивация завершена.");
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьПризникАрхивированДляРодителей()
	
	Для Каждого РодительДерева Из ФайлыДерево.ПолучитьЭлементы() Цикл
		ВсеАрхивированы = Истина;
		Для Каждого ЭлементДерева Из РодительДерева.ПолучитьЭлементы() Цикл
			Если НЕ ЭлементДерева.Архивирован Тогда
				ВсеАрхивированы = Ложь;
			КонецЕсли;
		КонецЦикла;
		РодительДерева.Архивирован = ВсеАрхивированы;
		Если РодительДерева.Архивирован Тогда
			РодительДерева.Пометка = Ложь;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьДанныеФайла(СтруктураПоиска)	
	
	МенеджерЗаписи = РегистрыСведений.ПрикрепленныеДанные.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Период						= СтруктураПоиска.Период;
	МенеджерЗаписи.ВидФайлаПрограммыПостроителя = СтруктураПоиска.ВидФайлаПрограммыПостроителя;
	МенеджерЗаписи.СсылкаНаОбъект 				= СтруктураПоиска.СсылкаНаОбъект;
	МенеджерЗаписи.ИмяФайла 					= СтруктураПоиска.ИмяФайла;						

	Попытка
		
		МенеджерЗаписи.Прочитать();
		КВозврату = новый Структура;
		КВозврату.Вставить("Расширение", МенеджерЗаписи.Расширение);
		КВозврату.Вставить("АдресВХранилище", ПоместитьВоВременноеХранилище(МенеджерЗаписи.Данные.Получить(), ЭтаФорма.УникальныйИдентификатор));
		
		Возврат КВозврату;
		
	Исключение
		
		Возврат Неопределено;
		
	КонецПопытки;
	
КонецФункции

&НаКлиенте
Функция ПодготовитьПутьДляПлатформы(ПлатформаWindows, Путь) Экспорт
	
	Если ПлатформаWindows Тогда
		ЧтоМенять = "/";
		НаЧтоМенять = "\";
	Иначе
		ЧтоМенять = "\";
		НаЧтоМенять = "/";
	КонецЕсли;
	
	Путь = СтрЗаменить(Путь, ЧтоМенять, НаЧтоМенять);
	Возврат Путь;
	
КонецФункции

&НаСервере
Функция ПолучитьМассивКаталогов()
	
	ТаблицаКаталогов = новый ТаблицаЗначений;
	ТаблицаКаталогов.Колонки.Добавить("ВидОбъекта", новый ОписаниеТипов("Строка"));
	ТаблицаКаталогов.Колонки.Добавить("МассивПодКаталогов", новый ОписаниеТипов("Массив"));
	
	Для Каждого РодительДерева Из ФайлыДерево.ПолучитьЭлементы() Цикл
		Для Каждого ЭлементДерева Из РодительДерева.ПолучитьЭлементы() Цикл
			
			Если НЕ ЭлементДерева.Пометка Тогда
				Продолжить;
			КонецЕсли;
			
			НайденнаяСтрока = ТаблицаКаталогов.НайтиСтроки(новый Структура("ВидОбъекта", ЭлементДерева.ВидОбъекта));
			Если НайденнаяСтрока.Количество() > 0 Тогда
				НоваяСтрока = НайденнаяСтрока[0];
			Иначе
				НоваяСтрока = ТаблицаКаталогов.Добавить();
			КонецЕсли;
			НоваяСтрока.ВидОбъекта = ЭлементДерева.ВидОбъекта;
			
			Если НоваяСтрока.МассивПодКаталогов.Найти(ЭлементДерева.СсылкаНаОбъект) = Неопределено Тогда
				НоваяСтрока.МассивПодКаталогов.Добавить(ЭлементДерева.СсылкаНаОбъект);
			КонецЕсли;
			
		КонецЦикла;
	КонецЦикла;
	
	Возврат ОбщегоНазначения.ТаблицаЗначенийВМассив(ТаблицаКаталогов);
	
КонецФункции

&НаКлиенте
Функция УбратьЗарезервированныеСимволыВИмениКаталога(ИсходноеИмя)
	
	Рез = ИсходноеИмя;
    Рез = СтрЗаменить(Рез, "\", "");
    Рез = СтрЗаменить(Рез, "/", "");
    Рез = СтрЗаменить(Рез, ":", "");
    Рез = СтрЗаменить(Рез, "*", "");
    Рез = СтрЗаменить(Рез, "?", "");
    Рез = СтрЗаменить(Рез, """", "");
    Рез = СтрЗаменить(Рез, "<", "");
    Рез = СтрЗаменить(Рез, ">", "");
    Рез = СтрЗаменить(Рез, "|", "");
    Рез = СтрЗаменить(Рез, "+", "");
    
    Возврат Рез;
	
КонецФункции

&НаСервере
Процедура УдалитьФайлПослеАрхивации(ЭлементТаблицы)
	
	МенеджерЗаписи = РегистрыСведений.ПрикрепленныеДанные.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Период						= ЭлементТаблицы.Период;
	МенеджерЗаписи.ВидФайлаПрограммыПостроителя = ЭлементТаблицы.ВидФайлаПрограммыПостроителя;
	МенеджерЗаписи.СсылкаНаОбъект 				= ЭлементТаблицы.СсылкаНаОбъект;
	МенеджерЗаписи.ИмяФайла 					= ЭлементТаблицы.ИмяФайла;						
	Попытка
		МенеджерЗаписи.Прочитать();
		МенеджерЗаписи.Удалить();
	Исключение
		Сообщить(ОписаниеОшибки());
	КонецПопытки;
	
КонецПроцедуры
//-- №9396

//++ №7253
&НаКлиенте
Процедура АрхивироватьПрикрепленныеДанные(Команда)
	
	// Чтобы выполнить архивацию по варианту в настройках, необходимо подготовить данные
	МассивДляАрхивации = новый Массив;
	
	Для Каждого РодительДерева Из ФайлыДерево.ПолучитьЭлементы() Цикл
		
		Для Каждого ЭлементДерева Из РодительДерева.ПолучитьЭлементы() Цикл
			
			Если НЕ ЭлементДерева.Пометка Тогда
				Продолжить;
			КонецЕсли;	
			
			СтруктураДанных = Новый Структура;
			СтруктураДанных.Вставить("Период", ЭлементДерева.Период);
			СтруктураДанных.Вставить("ВидФайлаПрограммыПостроителя", ЭлементДерева.ВидФайлаПрограммыПостроителя);
			СтруктураДанных.Вставить("СсылкаНаОбъект", ЭлементДерева.СсылкаНаОбъект);
			СтруктураДанных.Вставить("ИмяФайла", ЭлементДерева.ИмяФайла);
			СтруктураДанных.Вставить("ИдентификаторСтроки", ЭлементДерева.ПолучитьИдентификатор());
			
			МассивДляАрхивации.Добавить(СтруктураДанных);
			
		КонецЦикла;
		
	КонецЦикла;
	
	РезультатАрхивации = АрхивироватьПрикрепленныеДанныеНаСервере(МассивДляАрхивации);
	
	// Переносим успешный результат на форму
	Для Каждого СтрокаРезультата Из РезультатАрхивации Цикл
		
		Если Не СтрокаРезультата.Успешно Тогда
			Продолжить;
		КонецЕсли;
		
		ЭлементДерева = ФайлыДерево.НайтиПоИдентификатору(СтрокаРезультата.ИдентификаторСтроки);
		Если НЕ ЭлементДерева = Неопределено Тогда
			
			ЭлементДерева.Архивирован = Истина;
			ЭлементДерева.Пометка = Ложь;
			
		КонецЕсли;
		
	КонецЦикла;
	
	// Обновим признаки "Архивирован" для родителей
	ОбновитьПризникАрхивированДляРодителей();
	
	ПоказатьОповещениеПользователя("Архивация завершена.");
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция АрхивироватьПрикрепленныеДанныеНаСервере(МассивДляАрхивации)
	
	ТаблицаДанных = новый ТаблицаЗначений;
	ТаблицаДанных.Колонки.Добавить("Период", 						новый ОписаниеТипов("Дата"));
	ТаблицаДанных.Колонки.Добавить("ВидФайлаПрограммыПостроителя",	новый ОписаниеТипов("СправочникСсылка.ВидыФайловПрограммыПостроителя"));
	ТаблицаДанных.Колонки.Добавить("ИмяФайла", 						новый ОписаниеТипов("Строка",,,, новый КвалификаторыСтроки(255)));
	ТаблицаДанных.Колонки.Добавить("ИдентификаторСтроки", 			новый ОписаниеТипов("Число"));
	ТаблицаДанных.Колонки.Добавить("Успешно", 						новый ОписаниеТипов("Булево"));
	
	ОписаниеТипаОбъекта = новый ОписаниеТипов;
	ОписаниеТипаОбъекта = новый ОписаниеТипов(ОписаниеТипаОбъекта, Справочники.ТипВсеСсылки().Типы());
	ОписаниеТипаОбъекта = новый ОписаниеТипов(ОписаниеТипаОбъекта, Документы.ТипВсеСсылки().Типы());
	
	ТаблицаДанных.Колонки.Добавить("СсылкаНаОбъект", ОписаниеТипаОбъекта);
	
	Для Каждого ТекущаяСтрока Из МассивДляАрхивации Цикл
		
		НоваяСтрока = ТаблицаДанных.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекущаяСтрока);
		
	КонецЦикла;
	
	ОбщийМодульСервер.АрхивацияПрикрепленныхДанных(ТаблицаДанных);
	
	Возврат ОбщегоНазначения.ТаблицаЗначенийВМассив(ТаблицаДанных);
	
КонецФункции

//-- №7253
